In [7]:
from pandas import Series, DataFrame

In [10]:
score = Series( [1000,2000,3000,4000,5000])
score

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [12]:
score[3]

4000

In [13]:
score = Series( [1000,2000,3000], 
              index = ['2020-10-04','2020-10-05','2020-10-03'] )
score

2020-10-04    1000
2020-10-05    2000
2020-10-03    3000
dtype: int64

In [17]:
score['2020-10-04':'2020-10-03']

2020-10-04    1000
2020-10-05    2000
2020-10-03    3000
dtype: int64

In [18]:
for idx in score.index:
    print(idx)

2020-10-04
2020-10-05
2020-10-03

In [19]:
for idx in score.values:
    print(idx)

1000
2000
3000

In [20]:
print( type(score) )

<class 'pandas.core.series.Series'>

In [21]:
print( type(score.values) )

<class 'numpy.ndarray'>

In [23]:
dat = { 'col1':[1,2,3,4], 
        'col2':[10,20,30,40],
        'col3':['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [30]:
score1 = Series( [1000,2000,3000], 
              index = ['2020-10-04','2020-10-07','2020-10-03'] )

score2 = Series( [1000,2000,500], 
              index = ['2020-10-04','2020-10-08','2020-10-03'] )

score1 + score2

2020-10-03    3500.0
2020-10-04    2000.0
2020-10-07       NaN
2020-10-08       NaN
dtype: float64

In [35]:
# pd.concat([Series1, Series2, ...]
dat = pd.concat([score1, score2], axis=1)
dat

                 0       1
2020-10-04  1000.0  1000.0
2020-10-07  2000.0     NaN
2020-10-03  3000.0   500.0
2020-10-08     NaN  2000.0

In [38]:
dat.sort_index(inplace=True, axis=0)

In [39]:
dat

                 0       1
2020-10-03  3000.0   500.0
2020-10-04  1000.0  1000.0
2020-10-07  2000.0     NaN
2020-10-08     NaN  2000.0

In [40]:
score1 = Series( [1000,2000,3000], 
              index = [1,2,3] )

score2 = Series( [1000,2000,500], 
              index = [4,2,1] )

score1 + score2

1    1500.0
2    4000.0
3       NaN
4       NaN
dtype: float64

In [41]:
# pd.concat([Series1, Series2, ...]
dat = pd.concat([score1, score2], axis=1)
dat

        0       1
1  1000.0   500.0
2  2000.0  2000.0
3  3000.0     NaN
4     NaN  1000.0

In [42]:
import pandas as pd
from pandas import Series, DataFrame

In [43]:
print("pandas 버전 : ", pd.__version__)

pandas 버전 :  1.0.5

### 실습 2-1 시리즈 만들어보기
 * 5일간의 걸었던 걸음 횟수를 Series(시리즈) 자료형으로 만들어보기

In [44]:
score = Series( [3000, 6000, 7000, 10000, 13000])
print(score)
print("자료형 확인 : {} ".format( type(score) )  )

0     3000
1     6000
2     7000
3    10000
4    13000
dtype: int64
자료형 확인 : <class 'pandas.core.series.Series'>

In [45]:
print(score.index)

RangeIndex(start=0, stop=5, step=1)

In [46]:
print(score.values)

[ 3000  6000  7000 10000 13000]

In [47]:
print(score.dtype)

int64

In [49]:
score = Series( [3000, 6000, 7000, 10000, 13000], 
                index=['2019-05-01', '2019-05-02', '2019-05-03', '2019-05-04', '2019-05-05' ])
score

2019-05-01     3000
2019-05-02     6000
2019-05-03     7000
2019-05-04    10000
2019-05-05    13000
dtype: int64

In [50]:
score['2019-05-03':'2019-05-05']

2019-05-03     7000
2019-05-04    10000
2019-05-05    13000
dtype: int64

In [52]:
score[2:5]

2019-05-03     7000
2019-05-04    10000
2019-05-05    13000
dtype: int64

### 실습 2-2 
 * 2명의 5일간의 걸음수를 시리즈를 각각 만들어서, 더해보자.
 * 1명 2020/05/03 ~ 2020/05/07
 * 1명 2020/05/05 ~ 2020/05/09
 * toto, gildong (예)

In [53]:
count1 = Series( [3000, 6000, 7000, 10000, 13000], 
                index=['2019-05-03', '2019-05-04', '2019-05-05', '2019-05-06', '2019-05-07' ])

count2 = Series( [3000, 6000, 7000, 10000, 13000], 
                index=['2019-05-05', '2019-05-06', '2019-05-07', '2019-05-08', '2019-05-09' ])

count1 + count2

2019-05-03        NaN
2019-05-04        NaN
2019-05-05    10000.0
2019-05-06    16000.0
2019-05-07    20000.0
2019-05-08        NaN
2019-05-09        NaN
dtype: float64

* python에서 NaN : Not a Number 숫자가 아니다.

In [54]:
from pandas import DataFrame

dat = {'col1' : [1,2,3,4], 
       'col2' : [10, 20, 30, 40], 
       'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

### 실습 2-3 
 * 팀이 4개 팀이 있어요. 각각의 4일간의 팀별 점수를 넣어서 데이터 프레임을 만들기
 * 같은 날짜로 해 주기

In [56]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000] }

team_df = DataFrame(team_score, index=pd.date_range(start='10/5/2020', end='10/9/2020') )
team_df

            toto  apple  gildong  catanddog
2020-10-05  1500   4000     2000       7000
2020-10-06  3000   5000     2500       5000
2020-10-07  5000   6000     3000       3000
2020-10-08  7000   5500     4000       5000
2020-10-09  5500   4500     3000       4000

In [57]:
ts_days_idx1 = pd.date_range('2019-10-05', periods=5)

team_df1 = DataFrame(team_score, index= ts_days_idx1 )
team_df1

            toto  apple  gildong  catanddog
2019-10-05  1500   4000     2000       7000
2019-10-06  3000   5000     2500       5000
2019-10-07  5000   6000     3000       3000
2019-10-08  7000   5500     4000       5000
2019-10-09  5500   4500     3000       4000